image_category = (
    (("logo"), ("لوجو")),
    (("general"), ("عام")),
    (("ad"), ("إعلان")),
    (("featur_car"), ("شركات مميزة سيارات")),
    (("car"), ("سيارات")),
    (("featur_property"), ("شركات مميزة عقارات")),
    (("property"), ("عقارات")),
    (("featur_mobile"), ("شركات مميزة موبايل")),
    (("mobile"), ("موبايلات")),
    (("featur_access"), ("شركات مميزة اكسسوارات")),
    (("access"), ("إكسسوارات")),
    (("featur_midical"), ("شركات مميزة طبية")),
    (("midical"), ("مستلزمات طبية")),
    (("featur_electron"), ("شركات مميزة إلكترونيات")),
    (("electron"), ("إكترونيات وأجهزة منزلية")),
    (("featur_furniture"), ("شركات مميزة أثاث")),
    (("furniture"), ("أثاث منزلي")),
)

ad_type = (
    (("car_sales"),("car_sales")),
    (("car_rent"),("car_rent")),
    (("property_sales"),("property_sales")),
    (("property_rent"),("property_rent")),
    (("mobile"),("mobile")),
    (("access"),("access")),
    (("midical"),("midical")),
    (("electron"),("electron")),
    (("furniture"),("furniture")),
)

car_brand = (
    (("فيات"), ("فيات")),
    (("هيونداي"), ("هيونداي")),
    (("شيفورليه"), ("شيفورليه")),
    (("تويوتا"), ("تويوتا")),
    (("بي أم دبليو"), ("بي أم دبليو")),
    (("مرسيدس"), ("مرسيدس")),
    (("نيسان"), ("نيسان")),
    (("كيا"), ("كيا")),
)

gender_type = (
    (("ذكر"), ("ذكر")),
    (("أنثى"), ("أنثى")),
)

action_level = (
    (("Delete"), ("مسح")),
    (("Update"), ("تعديل")),
    (("Admin"), ("ادمن")),
    (("Normal"), ("عادي"))
)

sale_or_rent = (
    (('معروض للبيع'), ('معروض للبيع')),
    (('معروض للشراء'), ('معروض للشراء')),
)

car_price = (
    (('30000 - 100000'), ('30000 - 100000')),
    (('100000 - 300000'), ('100000 - 300000')),
    (('300000 - 500000'), ('300000 - 500000')),
    (('500000 - 1000000'), ('500000 - 1000000')),
    (('1000000 - 5000000'), ('1000000 - 5000000')),
)

condition_c = (
    (('مستعمل'), ('مستعمل')),
    (('جديد'), ('جديد')),
)

body_c = (
    (('يهكابورل'), ('يهكابورل')),
    (('هاتشباك'), ('هاتشباك')),
    (('سيدان'), ('سيدان')),
)

kilometer_c = (
    (('0 - 9999'), ('0 - 9999')),
    (('10000 - 39999'), ('10000 - 39999')),
    (('40000 - 70000'), ('40000 - 70000')),
    (('70000 - more'), ('70000 - اكثر')),
)

fuel_c = (
    (('ديزل'), ('ديزل')),
    (('كهرباء'), ('كهرباء')),
    (('غاز طبيعى'), ('غاز طبيعى')),
)

transmission_c = (
    (('يدوي'), ('يدوي')),
    (('أوتوماتيك'), ('أوتوماتيك')),
)

color_c = (
    (('اسود'), ('اسود')),
    (('فضي'), ('فضي')),
    (('ازرق'), ('ازرق')),
    (('بني'), ('بني')),
    (('ذهبي'), ('ذهبي')),
    (('نبيتي'), ('نبيتي')),
    (('ابيض'), ('ابيض')),
)

engin_c = (
    (('1400 - 1500'), ('1400 - 1500')),
    (('1600 - 1800'), ('1600 - 1800')),
    (('2000 - more'), ('2000 - more'))
)

extra_c = (
    (('مقاعد'), ('مقاعد')),
    (('فوانيس شبورة'), ('فوانيس شبورة')),
    (('مثبت سرعة'), ('مثبت سرعة')),
    (('بولوتوث'), ('بولوتوث')),
    (('عجلات للطرق الوعرة'), ('عجلات للطرق الوعرة')),
    (('نظام ملاحة'), ('نظام ملاحة')),
    (('راديو اف ام'), ('راديو اف ام')),
    (('وسائد هوائية'), ('وسائد هوائية')),
    (('تكييف'), ('تكييف')),
    (('شاحن يو اس بى'), ('شاحن يو اس بى')),
    (('فتحة سقف'), ('فتحة سقف')),
    (('كاميرات خلفية'), ('كاميرات خلفية')),
    (('زجاج كهربى'), ('زجاج كهربى')),
    (('مقاعد جلد'), ('مقاعد جلد')),
    (('مرايا كهربائية'), ('مرايا كهربائية')),
    (('سنتر لوك'), ('سنتر لوك')),
    (('حساسات ركن'), ('حساسات ركن')),
    (('جلد'), ('جلد')),
)

rental_period_c = (
    (('سنوى'), ('سنوى')),
    (('شهرى'), ('شهرى')),
    (('يومى'), ('يومى')),
)

rental_option_c = (
    (('مقدم'), ('مقدم')),
    (('مأخر'), ('مأخر')),
)

properties_price = (
    (('50000000 - more'), ('50000000 - أكثر')),
    (('10000000 - 50000000'), ('10000000 - 50000000')),
    (('5000000 - 10000000'), ('5000000 - 10000000')),
    (('1000000 - 5000000'), ('1000000 - 5000000')),
    (('500000 - 1000000'), ('500000 - 1000000')),
)

properties_type_c = (
    (('ستوديو'), ('ستوديو')),
    (('بنتهاوس'), ('بنتهاوس')),
    (('دوبلكس'), ('دوبلكس')),
    (('فيلا'), ('فيلا')),
    (('شقة'), ('شقة')),
)

compound_c = (
    (('هاى لاند بارك'), ('هاى لاند بارك')),
    (('هاى سيتى'), ('هاى سيتى')),
    (('جراندا'), ('جراندا')),
    (('الربوة'), ('الربوة')),
    (('الحياه'), ('الحياه')),
    (('ماونتن فيو اى سيتى'), ('ماونتن فيو اى سيتى')),
    (('مدينتى'), ('مدينتى')),
)

amenities_c = (
    (('اسانسير'), ('اسانسير')),
    (('غاز طبيعى'), ('غاز طبيعى')),
    (('عداد مياه'), ('عداد مياه')),
    (('عداد كهرباء'), ('عداد كهرباء')),
    (('حمام سباحة'), ('حمام سباحة')),
    (('غرفة خدمة'), ('غرفة خدمة')),
    (('امن'), ('امن')),
    (('حديقة خاصة'), ('حديقة خاصة')),
    (('اجهزة المطبخ'), ('اجهزة المطبخ')),
    (('شرفة'), ('شرفة')),
    (('تليفون ارضى'), ('تليفون ارضى')),
)

delivery_term_c = (
    (('نصف تشطيب'), ('نصف تشطيب')),
    (('محارة وحلوق'), ('محارة وحلوق')),
    (('طيببدون تش'), ('طيببدون تش')),
    (('متشطب'), ('متشطب'))
)

mobile_price_c = (
    (('1000 - 3000'), ('1000 - 3000')),
    (('3000 - 5000'), ('3000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 20000'), ('10000 - 30000')),
    (('20000 - 30000'), ('10000 - 30000')),
)

mobile_brand_c = (
    (('ايفون'), ('ايفون')),
    (('اوبو'), ('اوبو')),
    (('سامسونج'), ('سامسونج')),
    (('هواوى'), ('هواوى')),
    (('نوكيا'), ('نوكيا')),
    (('شاومى'), ('شاومى')),
)

payment_c = (
    (('كاش'), ('كاش')),
    (('تقسيط'), ('تقسيط')),
)

access_price_c = (
    (('200 - 500'), ('200 - 500')),
    (('500 - 1500'), ('500 - 1500')),
    (('1500 - 3000'), ('1500 - 3000')),
    (('3000 - 5000'), ('3000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
)

access_type_c = (
    (('احذية'), ('احذية')),
    (('شنط'), ('شنط')),
    (('نظارات'), ('نظارات')),
    (('ملابس'), ('ملابس')),
    (('ساعات'), ('ساعات')),
    (('اخرى'), ('اخرى'))
)

medical_price_c = (
    (('500 - 3000'), ('500 - 3000')),
    (('3000 - 10000'), ('3000 - 10000')),
    (('10000 - 20000'), ('10000 - 20000')),
    (('20000 - 50000'), ('20000 - 50000')),
    (('50000 - 200000'), ('50000 - 200000')),
)

medical_type_c = (
    (('الاسنان'), ('الاسنان')),
    (('العيون'), ('العيون')),
    (('المطياف الضوئى'), ('المطياف الضوئى')),
    (('حاضنة الاطفال'), ('حاضنة الاطفال')),
    (('قياس الاكسجين'), ('قياس الاكسجين')),
    (('الجراحة الكهربائى'), ('الجراحة الكهربائى')),
    (('التنفس الصناعى'), ('التنفس الصناعى')),
    (('غسيل كلوى'), ('غسيل كلوى')),
)

electronic_price_c = (
    (('1000 - 5000'), ('1000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 20000'), ('10000 - 20000')),
    (('20000 - 50000'), ('20000 - 50000')),
    (('50000 - 100000'), ('50000 - 100000')),
)

electronic_brand_c = (
    (('شارب'), ('شارب')),
    (('سامسونج'), ('سامسونج')),
    (('ال جى'), ('ال جى')),
    (('كريازى'), ('كريازى')),
    (('فريش'), ('فريش')),
    (('زانوسى'), ('زانوسى')),
    (('توشيبا'), ('توشيبا')),
)

electronic_type_c = (
    (('مايكروويف'), ('مايكروويف')),
    (('اجهزة نظافة'), ('اجهزة نظافة')),
    (('افران'), ('افران')),
    (('ديب فريزر'), ('ديب فريزر')),
    (('تكييفات'), ('تكييفات')),
    (('شاشات'), ('شاشات')),
    (('غسالات'), ('غسالات')),
    (('ثلاجات'), ('ثلاجات')),
)

furniture_price_c = (
    (('200 - 1000'), ('200 - 1000')),
    (('1000 - 5000'), ('1000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 30000'), ('10000 - 30000')),
    (('30000 - 50000'), ('30000 - 50000')),
)

department_name_c = (
    (('حمامات'), ('حمامات')),
    (('غرف النوم'), ('غرف النوم')),
    (('غرف السفرة'), ('غرف السفرة')),
    (('غرف معيشة'), ('غرف معيشة')),
    (('مطبخ'), ('مطبخ')),
)