image_category = (
    (("general"), ("عام")),
    (("featur_car"), ("شركات مميزة سيارات")),
    (("car_sale"), ("سيارات للبيع")),
    (("car_rent"), ("سيارات للإيجار")),
    (("featur_property"), ("شركات مميزة عقارات")),
    (("property_sale"), ("عقارات للبيع")),
    (("property_rent"), ("عقارات للإيجار")),
    (("featur_mobile"), ("شركات مميزة موبايل")),
    (("mobile"), ("موبايلات")),
    (("featur_access"), ("شركات مميزة اكسسوارات")),
    (("access"), ("إكسسوارات")),
    (("featur_midical"), ("شركات مميزة طبية")),
    (("midical"), ("مستلزمات طبية")),
    (("featur_electron"), ("شركات مميزة إلكترونيات")),
    (("electron"), ("إكترونيات وأجهزة منزلية")),
    (("featur_furniture"), ("شركات مميزة أثاث")),
    (("furniture"), ("أثاث منزلي")),
)

car_brand = (
    (("fiat"), ("فيات")),
    (("hyundai"), ("هيونداي")),
    (("chevrolet"), ("شيفورليه")),
    (("toyota"), ("تويوتا")),
    (("bmw"), ("بي أم دبليو")),
    (("mercedes"), ("مرسيدس")),
    (("nissan"), ("نيسان")),
    (("kia"), ("كيا")),
)

gender_type = (
    (("Male"), ("ذكر")),
    (("Female"), ("أنثى"))
)

action_level = (
    (("Delete"), ("مسح")),
    (("Update"), ("تعديل")),
    (("Admin"), ("ادمن")),
    (("Normal"), ("عادي"))
)

sale_or_rent = (
    (('sale'), ('معروض للبيع')),
    (('rent'), ('معروض للشراء'))
)

car_price = (
    (('30000 - 100000'), ('30000 - 100000')),
    (('100000 - 300000'), ('100000 - 300000')),
    (('300000 - 500000'), ('300000 - 500000')),
    (('500000 - 1000000'), ('500000 - 1000000')),
    (('1000000 - 5000000'), ('1000000 - 5000000')),
)

condition_c = (
    (('used'), ('مستعمل')),
    (('new'), ('جديد')),
)

body_c = (
    (('yhkaport'), ('يهكابورل')),
    (('hathpack'), ('هاتشباك')),
    (('sedan'), ('سيدان')),
)

kilometer_c = (
    (('0 - 9999'), ('0 - 9999')),
    (('10000 - 39999'), ('10000 - 39999')),
    (('40000 - 70000'), ('40000 - 70000')),
    (('70000 - more'), ('70000 - اكثر')),
)

fuel_c = (
    (('oil'), ('ديزل')),
    (('electric'), ('كهرباء')),
    (('gas'), ('غاز طبيعى')),
)

transmission_c = (
    (('manual'), ('يدوي')),
    (('automatic'), ('أوتوماتيك')),
)

color_c = (
    (('black'), ('اسود')),
    (('silver'), ('فضي')),
    (('blue'), ('ازرق')),
    (('brouwn'), ('بني')),
    (('gold'), ('ذهبي')),
    (('red'), ('نبيتي')),
    (('white'), ('ابيض')),
)

engin_c = (
    (('1400 - 1500'), ('1400 - 1500')),
    (('1600 - 1800'), ('1600 - 1800')),
    (('2000 - more'), ('2000 - more'))
)

extra_c = (
    (('chair'), ('مقاعد')),
    (('shpora'), ('فوانيس شبورة')),
    (('speed'), ('مثبت سرعة')),
    (('bluetouth'), ('بولوتوث')),
    (('wheel'), ('عجلات للطرق الوعرة')),
    (('navigation'), ('نظام ملاحة')),
    (('FM'), ('راديو اف ام')),
    (('Pillow'), ('وسائد هوائية')),
    (('AC'), ('تكييف')),
    (('USB'), ('شاحن يو اس بى')),
    (('ceiling'), ('فتحة سقف')),
    (('back camera'), ('كاميرات خلفية')),
    (("Electric Glass"), ('زجاج كهربى')),
    (('Leather seats'), ('مقاعد جلد')),
    (('Electric mirrors'), ('مرايا كهربائية')),
    (('center lock'), ('سنتر لوك')),
    (("corner sensors"), ('حساسات ركن')),
    (("leather"), ('جلد')),
)

rental_period_c = (
    (('year'), ('سنوى')),
    (('month'), ('شهرى')),
    (('day'), ('يومى')),
)

rental_option_c = (
    (('advance'), ('مقدم')),
    (('late'), ('مأخر')),
)

properties_price = (
    (('50000000 - more'), ('50000000 - أكثر')),
    (('10000000 - 50000000'), ('10000000 - 50000000')),
    (('5000000 - 10000000'), ('5000000 - 10000000')),
    (('1000000 - 5000000'), ('1000000 - 5000000')),
    (('500000 - 1000000'), ('500000 - 1000000')),
)

properties_type_c = (
    (('studio'), ('ستوديو')),
    (('penthouse'), ('بنتهاوس')),
    (('Duplex'), ('دوبلكس')),
    (('villa'), ('فيلا')),
    (('apartment'), ('شقة')),
)

compound_c = (
    (('Highland Park'), ('هاى لاند بارك')),
    (('High City'), ('هاى سيتى')),
    (('granda'), ('جراندا')),
    (('knoll'), ('الربوة')),
    (('life'), ('الحياه')),
    (('Mountain View iCity'), ('ماونتن فيو اى سيتى')),
    (('my city'), ('مدينتى')),
)

amenities_c = (
    (('elevator'), ('اسانسير')),
    (('natural gas'), ('غاز طبيعى')),
    (('water meter'), ('عداد مياه')),
    (('electricity meter'), ('عداد كهرباء')),
    (('Swimming pool'), ('حمام سباحة')),
    (('service room'), ('غرفة خدمة')),
    (('security'), ('امن')),
    (('private garden'), ('حديقة خاصة')),
    (('kitchen appliances'), ('اجهزة المطبخ')),
    (('Balcony'), ('شرفة')),
    (('telephone'), ('تليفون ارضى')),
)

delivery_term_c = (
    (('semi-finished'), ('نصف تشطيب')),
    (('oysters and throats'), ('محارة وحلوق')),
    (('ok without ch'), ('طيببدون تش')),
    (('crossed out'), ('متشطب'))
)

modile_price_c = (
    (('1000 - 3000'), ('1000 - 3000')),
    (('3000 - 5000'), ('3000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 20000'), ('10000 - 30000')),
    (('20000 - 30000'), ('10000 - 30000')),
)

mobile_brand_c = (
    (('Iphone'), ('ايفون')),
    (('Oppo'), ('اوبو')),
    (('Samsung'), ('سامسونج')),
    (('Huawei'), ('هواوى')),
    (('Nokia'), ('نوكيا')),
    (('Xiaomi'), ('شاومى')),
)

payment_c = (
    (('cash'), ('كاش')),
    (('installment'), ('تقسيط')),
)

access_price_c = (
    (('200 - 500'), ('200 - 500')),
    (('500 - 1500'), ('500 - 1500')),
    (('1500 - 3000'), ('1500 - 3000')),
    (('3000 - 5000'), ('3000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
)

access_type_c = (
    (('shoes'), ('احذية')),
    (('bags'), ('شنط')),
    (('glasses'), ('نظارات')),
    (('Clothes'), ('ملابس')),
    (('Hours'), ('ساعات')),
    (('other'), ('اخرى'))
)

medical_price_c = (
    (('500 - 3000'), ('500 - 3000')),
    (('3000 - 10000'), ('3000 - 10000')),
    (('10000 - 20000'), ('10000 - 20000')),
    (('20000 - 50000'), ('20000 - 50000')),
    (('50000 - 200000'), ('50000 - 200000')),
)

medical_type_c = (
    (('teeth'), ('الاسنان')),
    (('eyes'), ('العيون')),
    (('spectrophotometer'), ('المطياف الضوئى')),
    (('baby sitter'), ('حاضنة الاطفال')),
    (('measurement of oxygen'), ('قياس الاكسجين')),
    (('electrosurgery'), ('الجراحة الكهربائى')),
    (('Ventilator'), ('التنفس الصناعى')),
    (('dialysis'), ('غسيل كلوى')),
)

electronic_price_c = (
    (('1000 - 5000'), ('1000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 20000'), ('10000 - 20000')),
    (('20000 - 50000'), ('20000 - 50000')),
    (('50000 - 100000'), ('50000 - 100000')),
)

electronic_brand_c = (
    (('sharp'), ('شارب')),
    (('Samsung'), ('سامسونج')),
    (('LG'), ('ال جى')),
    (('kiriazi'), ('كريازى')),
    (('Fresh'), ('فريش')),
    (('Zanussi'), ('زانوسى')),
    (('Toshiba'), ('توشيبا')),
)

electronic_type_c = (
    (('microwave'), ('مايكروويف')),
    (('cleaning devices'), ('اجهزة نظافة')),
    (('furnaces'), ('افران')),
    (('Deep Freezer'), ('ديب فريزر')),
    (('adaptations'), ('تكييفات')),
    (('screens'), ('شاشات')),
    (('washers'), ('غسالات')),
    (('fridg'), ('ثلاجات')),
)

furniture_price_c = (
    (('200 - 1000'), ('200 - 1000')),
    (('1000 - 5000'), ('1000 - 5000')),
    (('5000 - 10000'), ('5000 - 10000')),
    (('10000 - 30000'), ('10000 - 30000')),
    (('30000 - 50000'), ('30000 - 50000')),
)

department_name_c = (
    (('bathrooms'), ('حمامات')),
    (('bedrooms'), ('غرف النوم')),
    (('dining rooms'), ('غرف السفرة')),
    (('living rooms'), ('غرف معيشة')),
    (('kitchen'), ('مطبخ')),
)